SUBSCRIPTION_COMMAND = 'подписка'
PRICES_COMMAND = 'цены'

PERIODS = {1: ['1 месяц', 5], 2: ['2 месяца', 9], 3: ['3 месяца', 12]}

GREETING_MESSAGE = f'Здравствуйте! Это бот Карединой Екатерины Федоровны. Если Вы хотите попасть в мой закрытый канал, напишите "{SUBSCRIPTION_COMMAND}". Чтобы узнать цены, напишите "{PRICES_COMMAND}". После подтверждения оплаты я вышлю Вам ссылку на добавление в канал.'
HELP_MESSAGE = f'Чтобы узнать цены на подписку - напишите "{PRICES_COMMAND}", что купить подписку - напишите "{SUBSCRIPTION_COMMAND}"'
PAYMENT_CONFIRMATION_REQUEST = 'Спасибо! Оплата отправлена на подтверждение.'
PAYMENT_CONFIRMATION = 'Оплата подтверждена. Ваша ссылка для добавления в канал: '
PAYMENT_REJECT = 'Оплата не была подтверждена. Свяжитесь с Екатериной Федоровной для получения дополнительной информации'
REMOVAL_MESSAGE = f'Ваша подписка истекла. Если Вы хотите подписаться еще раз, напишите "{SUBSCRIPTION_COMMAND}"'
TELEPHONE_NUMBER = '+79991234567'

ADMIN_ID = 999166963
CLEANER_INTERVAL_S = 5
